Revit 2027 API
ParameterTypeId.RebarBarStyle Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarBarStyle { get; }
Public Shared ReadOnly Property RebarBarStyle As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarBarStyle {
	ForgeTypeId^ get ();
}
static member RebarBarStyle : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace